/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_str_is_alpha.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gshim <gshim@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/29 15:19:25 by gshim             #+#    #+#             */
/*   Updated: 2021/03/29 15:19:25 by gshim            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
    알파벳이 포함되면 1, 아니면 0, 비어있으면 0
    이라는데, 만약 알파벳이랑 알파벳 아닌거랑 동시에잇으면
    어떻게 해야하지? 둘다 출력 or 애초에 하나의 경우로 정하는
    입력만 들어옴 인데, 둘다 출력이면 1,0인지 0,1인지 알려주었을테니
    애초에 하나의 경우만 들어온다고 가정하고 풀자.
*/

#include <stdio.h>

int ft_str_is_alpha(char *str)
{
    int i;

    i = 0;
    while (str[i] != '\0')
    {
        if (!(str[i] >= 97 && str[i] <= 122) || (str[i] >= 65 && str[i] <= 90) )
            return (0);
        i++;
    }
    return (1);
}

int main(){
    printf("%d ", ft_str_is_alpha("a21"));
}